Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་འཛིན་ཏོ།
en: It is in this way, Subhūti, that bodhisattva great beings, abiding in the perfection of perseverance, acquire the perfection of ethical discipline.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་འཛིན་པ་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, how will bodhisattva great beings, abiding in the perfection of perseverance, acquire the perfection of tolerance?” “

source: རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སེམས་དང་པོ་བསྐྱེད་པ་ནས་ཉེ་བར་བཟུང་སྟེ། སྙིང་པོ་བྱང་ཆུབ་ལ་འདུག་གི་བར་དུ་མིར་གྱུར་པ་འམ། མི་མ་ཡིན་པར་གྱུར་པས། སེམས་རྣམ་པར་འཁྲུགས་པར་བྱས་པ་འམ། ཡན་ལག་དང་ཉིང་ལག་བཅད་གཏུབས་ཤིང་ཁྱེར་ཏེ་དོང་ཡང་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་པ་དེ་འདི་སྙམ་དུ་བདག་ལས་ཅི་ཞིག་བཅད་དོ།
en: In this regard, Subhūti,” replied the Blessed One, “if humans or nonhumans should disturb the minds of bodhisattva great beings, from the time when they first begin to set their mind on enlightenment until they are seated at the site of enlightenment, or even cut off all their limbs and appendages, and depart carrying them off, those bodhisattva great beings who dwell in the perfection of perseverance would not think, ‘There is someone cutting me!

source: །བདག་ལས་ཅི་ཞིག་གཏུབས་སོ།
en: There is someone breaking me!

source: །བདག་ལས་ཅི་ཞིག་ཁྱེར་རོ་ཞེས་བྱ་བར་མི་སེམས་ཏེ།
en: There is someone carrying me off!’

source: གཞན་དུ་ན་དེ་འདི་སྙམ་དུ་གང་གི་ཕྱིར་བདག་གི་ལུས་ཡོངས་སུ་བསྒྲུབས་པ་དེ་དག་འདིར་འོང་ཞིང་ཡན་ལག་དང་ཉིང་ལག་བཅད་གཏུབས་ནས་ཁྱེར་ཞིང་འདོང་བ་ནི་བདག་གིས་ཐོབ་པར་བྱ་བ་ལེགས་པར་ཐོབ་བོ་སྙམ་མོ།
en: Rather, they would think, ‘While I have acquired this body for their sake, they have approached me, cutting off my limbs and appendages and departed, carrying them off, so I will obtain an excellent benefit!’

source: །དེས་ནི་ཆོས་རྣམས་ཀྱི་རང་བཞིན་ཡང་ལེགས་པར་ཡིད་ལ་བྱས་པ་ཡིན་ཏེ།
en: They will focus their attention completely on the nature of reality.

source: དགེ་བའི་རྩ་བ་དེ་དག་ཀྱང་ཉན་ཐོས་ཀྱི་ས་འམ། རང་སངས་རྒྱས་ཀྱི་སར་ཡོངས་སུ་མི་བསྔོའི། གཞན་དུ་ན་སེམས་ཅན་ཐམས་ཅད་དང་ཐུན་མོང་དུ་བྱས་ཤིང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོའོ།
en: They will not dedicate their roots of virtuous action to the level of the śrāvakas or to the level of the pratyekabuddhas, but making common cause with all beings, they will dedicate them toward unsurpassed, complete enlightenment.

source: །རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་འཛིན་ཏོ།
en: It is in this way, Subhūti, that bodhisattva great beings, abiding in the perfection of perseverance, acquire the perfection of tolerance.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་འཛིན་པ་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, how will bodhisattva great beings, abiding in the perfection of perseverance, acquire the perfection of meditative concentration?” “

source: རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འདོད་པས་དབེན། སྡིག་ཏོ་མི་དགེ་བའི་ཆོས་ཀྱིས་དབེན་པ། རྟོག་པ་དང་བཅས་པ། དཔྱོད་པ་དང་བཅས་པ། དབེན་པ་ལས་སྐྱེས་པའི་དགའ་བ་དང་བདེ་བ་ཅན་བསམ་གཏན་དང་པོ་ལ་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་སོ།
en: In this regard, Subhūti,” replied the Blessed One, “bodhisattva great beings achieve and then maintain the first meditative concentration, which is free from desires, free from negative and nonvirtuous attributes, and endowed with ideation and scrutiny, alongside the joy and bliss that arise from that freedom.

source: །དེ་རྣམ་པར་རྟོག་པ་དང་། རྣམ་པར་དཔྱོད་པ་ཉེ་བར་ཞི་ནས་ནང་ཡོངས་སུ་དང་སྟེ། སེམས་ཀྱི་རྒྱུད་གཅིག་ཏུ་གྱུར་པས་རྟོག་པ་མེད་པ། དཔྱོད་པ་མེད་པའི་ཏིང་ངེ་འཛིན་ལས་སྐྱེས་པའི་དགའ་བ་དང་བདེ་བ་ཅན་བསམ་གཏན་གཉིས་པ་ལ་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་སོ།
en: They achieve and then maintain the second meditative concentration when there is an intense inner clarity consequent on the calming of ideation and scrutiny—the absence of ideation and the absence of scrutiny being due to one-pointed mental focus—while the joy and bliss that arise from meditative stability are present.

source: །དེ་དགའ་བ་ལས་འདོད་ཆགས་དང་བྲལ་བས་དྲན་པ་དང་ལྡན་ཞིང་ཤེས་བཞིན་དུ་བཏང་སྙོམས་ལ་གནས་ཏེ།
en: They achieve and then maintain the third meditative concentration free from joy, when one dwells in equanimity due to the absence of attachment to joy, while both mindfulness and alertness are present, {Ki.

source: བདེ་བ་ལུས་ཀྱིས་མྱོང་ལ།
en: V: 92} and bliss is still experienced by the body.

source: ཡིད་མི་བདེ་བ་སྔ་ནས་ཀྱང་ནུབ་པས། བདེ་བ་ཡང་མེད། སྡུག་བསྔལ་བ་ཡང་མེད་པ། བཏང་སྙོམས་དང་དྲན་པས་ཡོངས་སུ་དག་པའི་བསམ་གཏན་བཞི་པ་ལ་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་སོ།
en: Here, neither suffering nor bliss is present because even former blissful and unhappy states of mind have subsided, while equanimity and mindfulness are utterly pure.

source: །དེ་སེམས་ཅན་རྣམས་ལ་བདེ་བའི་འདུ་ཤེས་ཡིད་ལ་བྱེད་པས་བྱམས་པ་ཚད་མེད་པ་ལ་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་སོ།
en: They maintain and then dwell in the immeasurable aspiration of loving kindness by focusing attention on the perception that beings should be happy.

source: །དེ་སེམས་ཅན་རྣམས་ལ་སྡུག་བསྔལ་དང་བྲལ་བའི་འདུ་ཤེས་ཡིད་ལ་བྱེད་པས་སྙིང་རྗེ་ཚད་མེད་པ་ལ་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་སོ།
en: They maintain and then dwell in the immeasurable aspiration of compassion by focusing attention on the perception that beings should be free from suffering.

source: །དེ་སེམས་ཅན་རྣམས་ལ་དགའ་བའི་འདུ་ཤེས་ཡིད་ལ་བྱེད་པས། དགའ་བ་ཚད་མེད་པ་ལ་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་སོ།
en: They maintain and then dwell in the immeasurable aspiration of empathetic joy by focusing attention on the perception that beings should be joyful.

source: །དེ་སེམས་ཅན་རྣམས་ལ་སྡུག་བསྔལ་དང་བདེ་བ་མེད་པའི་འདུ་ཤེས་ཡིད་ལ་བྱེད་པས་བཏང་སྙོམས་ཚད་མེད་པ་ལ་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་སོ།
en: They maintain and then dwell in the immeasurable aspiration of equanimity by focusing attention on the perception that beings should be free from [the dichotomy of] suffering and happiness.

source: །དེ་གཟུགས་ལ་ཆེ་ལོང་དུ་འདུ་ཤེས་ཤིང་། ནམ་མཁའ་ལ་ཞི་བར་འདུ་ཤེས་པ་ཡིད་ལ་བྱེད་པས་ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་ལ་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་སོ།
en: They maintain and then dwell in the sphere of infinite space by focusing attention on the perception that physical forms have largely been transcended and the perception that they have come to rest in space.

source: །དེ་ནམ་མཁའ་ལ་ཆེ་ལོང་དུ་འདུ་ཤེས་ཤིང་། རྣམ་པར་ཤེས་པ་ལ་ཞི་བར། འདུ་ཤེས་པ་ཡིད་ལ་བྱེད་པས། རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་ལ། ཉེ་བར་བསྒྲུབས་ཏེ་གནས་སོ།
en: They maintain and then dwell in the sphere of infinite consciousness by focusing attention on the perception that space has largely been transcended and the perception that it has come to rest in consciousness.

source: །དེ་རྣམ་པར་ཤེས་པ་ལ་ཆེ་ལོང་དུ་འདུ་ཤེས་ཤིང་། ཅུང་ཟད་མེད་པ་ལ་ཞི་བར་འདུ་ཤེས་པ་ཡིད་ལ་བྱེད་པས། ཅུང་ཟད་མེད་པའི་སྐྱེ་མཆེད་ལ་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་སོ། །དེ་ཅུང་ཟད་མེད་པ་ལ་ཆེ་ལོང་དུ་འདུ་ཤེས་པས།
en: They maintain and then dwell in the sphere of nothing-at-all by focusing attention on the perception that consciousness has largely been transcended and the perception that it has come to rest in nothing-at-all.

source: འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་ལ་ཞི་བར་འདུ་ཤེས་པ་ཡིད་ལ་བྱེད་པས། འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ལ་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་སོ།
en: They maintain and then dwell in the sphere of neither perception nor nonperception by focusing attention on the perception that nothing-at-all has largely been transcended and the perception that it has come to rest in the state of neither perception nor nonperception.

source: །དེ་བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དེ་དག་གི་རྣམ་པར་སྨིན་པ་ཡོངས་སུ་མི་ལེན་ཏེ།
en: However, they do not grasp the maturation of those meditative concentrations, immeasurable attitudes, and formless absorptions.

source: གཞན་དུ་ན་སེམས་ཅན་རྣམས་ཀྱི་དོན་བྱ་བའི་ཕྱིར་དེ་དག་ཏུ་སྐྱེ་ཞིང་སེམས་ཅན་དེ་དག་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་།
en: Rather, for the sake of beings, they will be reborn [in other realms] where they will bring beings to maturity in the perfection of generosity, the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, the perfection of wisdom, and in all these six perfections.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་པོ་འདི་དག་ལ་ཡོངས་སུ་སྨིན་པར་བྱེད་དོ། །དགེ་བའི་རྩ་བ་བསྐྱེད་པའི་དོན་དུ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ལ་བསྙེན་བཀུར་བྱེད་ཅིང་སངས་རྒྱས་ཀྱི་ཞིང་ནས་སངས་རྒྱས་ཀྱི་ཞིང་དུ་འགྲོ་སྟེ།
en: In order to cultivate the roots of virtuous action, they venerate the lord buddhas and move from buddhafield to buddhafield.

source: རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་འཛིན་ཏོ།
en: It is in this way, Subhūti, that bodhisattva great beings, abiding in the perfection of perseverance, acquire the perfection of meditative concentration.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་འཛིན་པ་ལགས།
en: Blessed Lord, how will bodhisattva great beings, abiding in the perfection of perseverance, acquire the perfection of wisdom?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དངོས་པོ་དང་། རྫས་དང་། མཚན་མར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་།
en: In this regard, Subhūti,” replied the Blessed One, “bodhisattva great beings, abiding in the perfection of perseverance, do not observe the perfection of generosity as an entity, as a substance, or as a sign.

source: ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་།
en: They do not observe the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, {Ki.

source: བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དངོས་པོ་དང་།
en: V: 93} the perfection of meditative concentration, or the perfection of wisdom as an entity, as a substance, or as a sign.

source: རྫས་དང་། མཚན་མར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་། ནང་སྟོང་པ་ཉིད་དངོས་པོ་དང་། རྫས་དང་།
en: They do not observe the emptiness of internal phenomena as an entity, as a substance, or as a sign.

source: མཚན་མར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་དངོས་པོ་དང་། རྫས་དང་། མཚན་མར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་།
en: They do not observe [all the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, as an entity, as a substance, or as a sign.

source: དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་དངོས་པོ་དང་། རྫས་དང་། མཚན་མར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་། ཡང་དག་པར་སྤོང་བ་དང་།
en: They do not observe the applications of mindfulness as an entity, as a substance, or as a sign.

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་། སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་དངོས་པོ་དང་། རྫས་དང་།
en: They do not observe the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, or the noble eightfold path as an entity, as a substance, or as a sign.

source: མཚན་མར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་། འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དངོས་པོ་དང་།
en: They do not observe the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, or the formless absorptions as an entity, as a substance, or as a sign.

source: རྫས་དང་། མཚན་མར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་། །རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་དངོས་པོ་དང་།
en: They do not observe the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, or the extrasensory powers as an entity, as a substance, or as a sign.

source: རྫས་དང་། མཚན་མར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་དངོས་པོ་དང་། རྫས་དང་།
en: They do not observe the meditative stabilities or the dhāraṇī gateways as an entity, as a substance, or as a sign.

source: མཚན་མར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་དངོས་པོ་དང་།
en: They do not observe the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, or the eighteen distinct qualities of the buddhas as an entity, as a substance, or as a sign.

source: རྫས་དང་། མཚན་མར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་དངོས་པོ་དང་། རྫས་དང་། མཚན་མར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་བ་སྟེ།
en: They do not observe [the goals], up to and including all-aspect omniscience, as an entity, as a substance, or as a sign.

source: ཆོས་ཐམས་ཅད་དངོས་པོ་དང་། རྫས་དང་། མཚན་མར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་བས།
en: Since they do not observe anything as an entity, as a substance, or as a sign, they do not dwell in anything at all.

source: ཆོས་གང་ལ་ཡང་གནས་མི་འཆའ་ཞིང་དེ་ཇི་སྐད་དུ་སྨྲ་བ་དེ་ལྟར་བྱེད་པ་ཡིན་ཏེ།
en: They do as they say.

source: རབ་འབྱོར་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་འཛིན་ཏོ།
en: It is in this way, Subhūti, that bodhisattva great beings, abiding in the perfection of perseverance, acquire the perfection of wisdom.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་འཛིན་པ་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, how will bodhisattva great beings, abiding in the perfection of meditative concentration, acquire the perfection of generosity?” “

source: །དེ་རྣམ་པར་རྟོག་པ་དང་། རྣམ་པར་དཔྱོད་པ་ཉེ་བར་ཞི་ནས་ནང་ཡོངས་སུ་དང་སྟེ། སེམས་ཀྱི་རྒྱུད་གཅིག་ཏུ་གྱུར་པས་རྟོག་པ་མེད་པ། དཔྱོད་པ་མེད་པ། ཏིང་ངེ་འཛིན་ལས་སྐྱེས་པའི་དགའ་བ་དང་བདེ་བ་ཅན་བསམ་གཏན་གཉིས་པ་ལ་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་སོ།
en: They achieve and then maintain the second meditative concentration when there is an intense inner clarity consequent on the calming of ideation and scrutiny—the absence of ideation and the absence of scrutiny being due to one-pointed mental focus—while the joy and bliss that arise from meditative stability are present.

source: །དེ་དགའ་བ་ལས་འདོད་ཆགས་དང་བྲལ་བས་དྲན་པ་དང་ལྡན་ཞིང་། ཤེས་བཞིན་དུ་བཏང་སྙོམས་ལ་གནས་ཏེ། བདེ་བ་ལུས་ཀྱིས་མྱོང་ལ།
en: They achieve and then maintain the third meditative concentration free from joy, abiding in equanimity due to the absence of attachment to joy, while both mindfulness and alertness are present, and bliss is still experienced by the body.

source: ཡིད་བདེ་བ་དང་། ཡིད་མི་བདེ་བ་སྔ་ནས་ཀྱང་ནུབ་པས། བདེ་བ་ཡང་མེད། སྡུག་བསྔལ་བ་ཡང་མེད་པ། བཏང་སྙོམས་དང་དྲན་པས་ཡོངས་སུ་དག་པ་བསམ་གཏན་བཞི་པ་ལ་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་སོ།
en: Here, neither suffering nor bliss is present because even former blissful and unhappy states of mind have subsided, while equanimity and mindfulness are utterly pure. {

source: །དེ་འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ཀྱི་བར་ལ་ཡང་དེ་བཞིན་དུ་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་སོ།
en: Ki.V: 94} They also achieve and then maintain [the immeasurable attitudes and the formless absorptions], up to and including the sphere of neither perception nor nonperception.

source: །དེ་བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དེ་ལ་གནས་ནས་མི་གཡེང་བའི་ཡིད་ཀྱིས། སེམས་ཅན་དེ་དག་ལ་ཟང་ཟིང་གི་སྦྱིན་པ་དང་། ཆོས་ཀྱི་སྦྱིན་པ་ཡོངས་སུ་གཏོང་ཞིང་། གཞན་ཡང་ཟང་ཟིང་གི་སྦྱིན་པ་དང་ཆོས་ཀྱི་སྦྱིན་པ་ལ་ཡང་དག་པར་བསྐུལ་ལོ། །ཟང་ཟིང་གི་སྦྱིན་པ་དང་།
en: Abiding in this perfection of meditative concentration, with an undistracted mind, they dispense the gift of the Dharma, and also material gifts, to beings, and they encourage others to keep dispensing the gift of the Dharma and material gifts.

source: ཆོས་ཀྱི་སྦྱིན་པའི་ལེགས་པ་ཡང་བརྗོད་དོ། །གཞན་ཡང་ཟང་ཟིང་གི་སྦྱིན་པ་དང་། ཆོས་ཀྱི་སྦྱིན་པ་ཡོངས་སུ་གཏོང་བ་དེ་དག་གི་ལེགས་པ་ཡང་བརྗོད་ཅིང་འཐུན་པས་དགའ་བར་བྱེད་པ་ཡིན་ཏེ།
en: They also praise the gift of the Dharma and material gifts, and they praise and take empathetic delight in others dispensing the gift of the Dharma and material gifts.

source: དགེ་བའི་རྩ་བ་དེ་དག་ཀྱང་ཉན་ཐོས་ཀྱི་ས་འམ། རང་སངས་རྒྱས་ཀྱི་སར་ཡོངས་སུ་མི་བསྔོའི། གཞན་དུ་ན་སེམས་ཅན་ཐམས་ཅད་དང་ཐུན་མོང་དུ་བྱས་ཤིང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོ་སྟེ།
en: They do not dedicate these roots of virtuous action to the level of the śrāvakas or to the level of the pratyekabuddhas, but making common cause with all beings, they dedicate them toward unsurpassed, complete enlightenment.

source: རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་འཛིན་ཏོ།
en: It is in this way, Subhūti, that bodhisattva great beings, abiding in the perfection of meditative concentration, acquire the perfection of generosity.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་འཛིན་པ་ལགས།
en: Blessed Lord, how will bodhisattva great beings, abiding in the perfection of meditative concentration, acquire the perfection of ethical discipline?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་། སེམས་འདོད་ཆགས་དང་ལྡན་པ་མི་སྐྱེད།
en: In this regard, Subhūti,” replied the Blessed One, “bodhisattva great beings, abiding in the perfection of meditative concentration, do not develop thoughts of desire.

source: སེམས་ཞེ་སྡང་དང་ལྡན་པ་དང་། གཏི་མུག་དང་ལྡན་པ་དང་། འཚེ་བ་དང་ལྡན་པ་མི་སྐྱེད་དེ།
en: They do not develop thoughts of hatred, delusion, or violence.

source: གཞན་དུ་ན་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱེད་པས་རྣམ་པར་སྤྱོད་ཅིང་།
en: Rather, they practice as they focus their attention on all-aspect omniscience.

source: རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་འཛིན་ཏོ།
en: It is in this way, Subhūti, that bodhisattva great beings, abiding in the perfection of meditative concentration, acquire the perfection of ethical discipline.” “

source: །གསོལ་པ། །བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་འཛིན་པ་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, how will bodhisattva great beings, abiding in the perfection of meditative concentration, acquire the perfection of tolerance?” “

source: རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་། གཟུགས་ལ་དབུ་བ་ལྟ་བུར་རབ་ཏུ་རྟོག །
en: In this regard, Subhūti,” replied the Blessed One, “bodhisattva great beings, abiding in the perfection of meditative concentration, discern physical forms as resembling foam.

source: ཚོར་བ་ལ་ཆུ་བུར་ལྟ་བུ་དང་། འདུ་ཤེས་ལ་སྨིག་རྒྱུ་ལྟ་བུ་དང་། འདུ་བྱེད་ལ་ཆུ་ཤིང་ལྟ་བུ་དང་། རྣམ་པར་ཤེས་པ་ལ་སྒྱུ་མ་ལྟ་བུར་རབ་ཏུ་རྟོག་སྟེ།
en: They discern feelings as resembling a water bubble, perceptions as resembling a mirage, formative predispositions as resembling a hollow plantain, and consciousness as resembling a magical display.

source: དེ་དེ་ལྟར་ལེན་པའི་ཕུང་པོ་ལྔ་ལ་སོ་སོར་རྟོག་ཅིང་། སྙིང་པོ་མེད་པར་འདུ་ཤེས་ཉེ་བར་གནས་པ་ཡིན་ཏེ། དེ་དེ་ལྟར་སོ་སོར་རྟོག་པས་དེ་འདི་སྙམ་སྟེ། ཡན་ལག་དང་ཉིང་ལག་ཡོངས་སུ་གཏུབས་ཀྱང་སུ་ལ་གཅོད་སུ་ལ་གཅད་ལུས་ནི་སུའི་ལུས།
en: When making such discernments, they maintain the perception that these five acquisitive aggregates are essenceless, thinking, ‘Even though my limbs and appendages are being cut off, who is doing the cutting and who is being cut? {

source: ཚོར་བ་ནི་སུའི་ཚོར་བ།
en: Ki.V: 95} Whose is this body? Whose are these feelings?

source: འདུ་ཤེས་ནི་སུའི་འདུ་ཤེས།
en: Whose are these perceptions?

source: འདུ་བྱེད་ནི་སུའི་འདུ་བྱེད།
en: Whose are these formative predispositions?

source: རྣམ་པར་ཤེས་པ་ནི་སུའི་རྣམ་པར་ཤེས་པ་སྙམ་སྟེ།
en: Whose is this consciousness?’

source: དེ་དེ་ལྟར་སོ་སོར་རྟོག་པའི་ཚེ་འདི་སྙམ་སྟེ། གང་ལ་སྤྱོ་བ་དང་། ཀྱལ་པ་བྱས་ན་གནོད་སེམས་སྐྱེ་བ་དེ་ལྟ་བུའི་གཤེ་བ་ཡང་གང་ཞིག་ཡོད།
en: When they discern in that manner, they then think, ‘When someone is being criticized and reprimanded, who is being scolded and reprimanded, giving rise to such malicious thoughts?’

source: འཁྱལ་བ་ཡང་གང་ཞིག་ཡོད་སྙོམ་སྟེ། རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་ཤིང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་འཛིན་ཏོ།། །།ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ། བམ་པོ་ལྔ་བཅུ་བརྒྱད་པ།
en: It is in this way, Subhūti, that bodhisattva great beings, abiding in the perfection of meditative concentration, acquire the perfection of tolerance.” “

source: གསོལ་པ། བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་འཛིན་པ་ལགས།
en: Blessed Lord, how will bodhisattva great beings, abiding in the perfection of meditative concentration, acquire the perfection of perseverance?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་ཤིང་། འདོད་པས་དབེན་སྡིག་ཏོ་མི་དགེ་བའི་ཆོས་ཀྱིས་དབེན་པ། རྟོག་པ་དང་བཅས་པ། དཔྱོད་པ་དང་བཅས་པ།
en: In this regard, Subhūti,” replied the Blessed One, “bodhisattva great beings, abiding in the perfection of meditative concentration, achieve and then maintain the first meditative concentration, which is free from the desires [of the senses], free from negative and nonvirtuous attributes, and endowed with ideation and scrutiny, alongside the joy and bliss that arise from that freedom.

source: དབེན་པ་ལས་སྐྱེས་པའི་དགའ་བ་དང་། བདེ་བ་ཅན་བསམ་གཏན་དང་པོ་ལ་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་སོ། །དེ་རྣམ་པར་རྟོག་པ་དང་རྣམ་པར་དཔྱོད་པ་ཉེ་བར་ཞི་ནས། ནད་ཡོངས་སུ་དང་སྟེ། སེམས་ཀྱི་རྒྱུད་གཅིག་ཏུ་གྱུར་པས། རྟོག་པ་མེད་པ། དཔྱོད་པ་མེད་པ།
en: They achieve and then maintain the second meditative concentration when there is an intense inner clarity consequent on the calming of ideation and scrutiny— the absence of ideation and the absence of scrutiny being due to one-pointed mental focus—while the joy and bliss that arise from meditative stability are present.

source: ཏིང་ངེ་འཛིན་ལས་སྐྱེས་པའི་དགའ་བ་དང་། བདེ་བ་ཅན་བསམ་གཏན་གཉིས་པ་ལ་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་སོ། །དེ་དགའ་བ་ལས་འདོད་ཆགས་དང་བྲལ་བས་དྲན་པ་དང་ལྡན་ཞིང་། ཤེས་བཞིན་དུ་བཏང་སྙོམས་ལ་གནས་ཏེ། བདེ་བ་ལུས་ཀྱིས་མྱོང་ལ།
en: They achieve and then maintain the third meditative concentration free from joy, abiding in equanimity due to the absence of attachment to joy, while both mindfulness and alertness are present, and bliss is still experienced by the body.

source: འཕགས་པ་རྣམས་ཀྱིས་དྲན་པ་དང་ལྡན་པ་བདེ་བ་ལ་རྣམ་པར་སྤྱོད་པ་བཏང་སྙོམས་པའོ་ཞེས་བརྗོད་པ་སྟེ།
en: This is what sublime beings describe as ‘mindful, abiding in bliss, and equanimous.’

source: ཡིད་བདེ་བ་དང་། ཡིད་མི་བདེ་བ་སྔ་ནས་ཀྱང་ནུབ་པས། བདེ་བ་ཡང་མེད། སྡུག་བསྔལ་བ་ཡང་མེད་པ། བཏང་སྙོམས་དང་དྲན་པས་ཡོངས་སུ་དག་པའི་བསམ་གཏན་བཞི་པ་ལ་ཉེ་བར་བསྒྲུབས་ཤིང་གནས་ཏེ།
en: Here, neither suffering nor bliss is present because even former blissful and unhappy states of mind have subsided, while equanimity and mindfulness are utterly pure.

source: དེ་བསམ་གཏན་དང་། བསམ་གཏན་གྱི་ཡན་ལག་དེ་དག་ལ་ཡང་མཚན་མར་མི་འཛིན་ཏོ།
en: And yet, they do not grasp these meditative concentrations and ancillary aspects of meditative concentration as signs or mental concepts.

source: །དེ་དེ་ལྟར་མཉམ་པར་བཞག་པའི་སེམས་དང་ལྡན་པས་རྫུ་འཕྲུལ་རྣམ་པ་དུ་མ་ཉམས་སུ་མྱོང་བར་བྱེད་དེ།
en: Since their minds are endowed with such absorption, they experience many facets of miraculous ability.

source: དེ་ས་ཆེན་པོ་འདི་ཡང་རབ་ཏུ་གཡོ་བར་བྱེད་དོ།
en: They may even cause this mighty earth to shake.
